#!/bin/sh
#多个命令以分号分隔放置()中，则会启用子shell并执行。
#例如：(mkdir testdir;cd testdir;touch testfile)
#多个命令以分号分隔放置{}中，则会在当前shell中执行。需要注意的是命令和{}必须有空格间隔，并且最后一条命令也必须加分号。
echo '脚本的进程号：',$$ 
pstree -up|grep sshd
echo ------------------------------------------------------------------------
(pstree -up|grep sshd;echo '脚本的进程号：',$$)
echo ------------------------------------------------------------------------
{ pstree -up|grep sshd;echo '脚本的进程号：',$$; }
echo ------------------------------------------------------------------------
echo '脚本的进程号：',$$ 
pstree -up|grep sshd